#Посчитать:
# 1) Сумму ряда 0 - 88888888
# 2) Среднее арифметическое ряда [3, 4, 56, 100, 2, 2, 3]
# 3) Заменить в строке "asdxfghyxyx" все буквы "х" на "у"
# 4) Сосчитать произведение чисел [3, 4, 56, 100, 15, 2, 20, 30],
#    кратных и 3 и 5.
# 5) Заменить все буквы "х" на "у" в исходной строке
#    без использования дополнительной строки.

#задание 1
x = 0
for i in range(88888889):
    x = x + i
print(x)

#задание 2
Y = [3, 4, 56, 100, 2, 2, 3]
count = len(Y)
b = 0
while Y:
    b = b + Y.pop()
print(b/count)

#задание 3
m = 'asdxfghyxyx'
l = ''
for i in m:
    if i == 'x':
        l = l + 'y'
    else:
        l = l + i
print(l)

# задание 4
K = [3, 4, 56, 100, 15, 2, 20, 30]
n = 1
for i in K:
    if (i % 3 == 0) and (i % 5 == 0):
        n = n * i
print(n)

# задание 5
z = 'asdxfghyxyx'
print(z.replace('x','y'))

